Revit 2020 API
Marble Class
 Represents the properties of materials.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2018.1
Syntax
C#
public static class Marble
Visual Basic
Public NotInheritable Class Marble
Visual C++
public ref class Marble abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Marble
See Also
Marble Members
Autodesk.Revit.DB.Visual Namespace